Documents/Бронирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Бронирование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОчередьБронирования</xr:Item>
				<xr:Item>InformationRegister.СтатусыОбъектовНедвижимости</xr:Item>
				<xr:Item>InformationRegister.СрокиБронированияОбъектовНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗапрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьСрокаБронирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацииБронирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляСнятияБронирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомКлик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтатусыОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СтатусыОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСделку</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацииБронирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыОперацииБронирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бронирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеБронирования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтатусыОбъектовНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Забронирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданДольщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переуступка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОформлении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезСтатуса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Бронирование/Forms/ФормаДокументаБронирование/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Пользователи.РолиДоступны("РедактированиеСрокаБронирования") Тогда
		Элементы.ДлительностьСрокаБронирования.ТолькоПросмотр = Ложь;		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Отказ = ПроверитьВозможностьСозданияДокумента();
		Если Отказ Тогда
			Сообщение 		= Новый СообщениеПользователю;
			Сообщение.Текст = "По объекту недвижимости: """ + Объект.ОбъектНедвижимости + """ нельзя завести документ бронирования, по причине отсутствия допустимого статуса!";
			Сообщение.Сообщить();
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Проект) Тогда
			Объект.ДлительностьСрокаБронирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Проект, "ДлительностьБронирования");
		КонецЕсли;
		//Если ЗначениеЗаполнено(Объект.Проект) 
		//		И НЕ CRMУправлениеОбъектамиНедвижимостиСервер.ОбъектНедвижимостиЗабронирован(Объект.ОбъектНедвижимости) Тогда
			//Объект.ДатаНачалаСрокаБронирования 	= ТекущаяДата();
			//Объект.ДатаКонцаСрокаБронирования 	= ТекущаяДата() + 86400 * Объект.ДлительностьСрокаБронирования;
		//КонецЕсли;
		Элементы.ФормаВвестиДокументСнятияСБронирования.Видимость = Ложь;
		
		//<852115>, Басаргин (08.08.2018) {
		Объект.ДомКлик = УправлениеДоступом.ЕстьРоль("БронированиеДомКлик", , ПользователиКлиентСервер.АвторизованныйПользователь()) И Не Пользователи.ЭтоПолноправныйПользователь();
		//<852115> }
	Иначе		
		ДействующаяБронь = ПолучитьПризнакДействующейБрони(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если НЕ Объект.Автор = Пользователи.АвторизованныйПользователь()
			//EXTCODE Шумилин Сергей 25.10.2017 {{ --->Временно
			И НЕ Пользователи.РолиДоступны("СозданиеСнятияСБронирования")
			И НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда
			//EXTCODE Шумилин Сергей 25.10.2017 <--- }} 
		КоманднаяПанель.ПодчиненныеЭлементы.ФормаВвестиДокументСнятияСБронирования.Доступность = Ложь;
	Иначе
		КоманднаяПанель.ПодчиненныеЭлементы.ФормаВвестиДокументСнятияСБронирования.Доступность = НЕ ВведёнДокументСнятияСБронирования();
	КонецЕсли;
	
	
	//ЭлементУО 			= УсловноеОформление.Элементы.Добавить();
	//ПолеЭлемента		= ЭлементУО.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле	= Новый ПолеКомпоновкиДанных("ФормаСкажиПривет");		
	//ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	//														"Автор", ВидСравненияКомпоновкиДанных.НеРавно, Пользователи.АвторизованныйПользователь());	
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//<852115>, Басаргин (08.08.2018) {
	Если Объект.ДомКлик 
		И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииБронирования.Бронирование") 
		И НЕ ПараметрыЗаписи.Свойство("ОтправлятьSMS_ДомКлик") Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаМенеджеру", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Создать SMS по бронированию ДомКлик?", РежимДиалогаВопрос.ДаНет, 0); 
	КонецЕсли;	
	//<852115> }
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	//<852115>, Басаргин (08.08.2018) {
	Если Объект.ДомКлик 
		И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииБронирования.Бронирование") 
		И ПараметрыЗаписи.Свойство("ОтправлятьSMS_ДомКлик") Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ОтправлятьSMS_ДомКлик", ПараметрыЗаписи.ОтправлятьSMS_ДомКлик);
		Если ПараметрыЗаписи.Свойство("ОтправлятьSMS_ДомКлик") Тогда
			ПараметрыЗаписи.Удалить("ОтправлятьSMS_ДомКлик");
		КонецЕсли;
	КонецЕсли;
	//<852115> }
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("СобытиеБронирования");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВвестиДокументСнятияСБронирования(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиДокументСнятияСБронированияЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, 
						"Перед вводом документа с видом операции ""Снятие с бронирования"" необходимо сначала записать текущий документ. Продолжить?",
						РежимДиалогаВопрос.ДаНет, 
						60);	
						
	Иначе
						
		СоздатьДокументБронирования();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаМенеджеру(Результат, ДополнительныеПараметры) Экспорт
	
	Записать(Новый Структура("РежимЗаписи, ОтправлятьSMS_ДомКлик", РежимЗаписиДокумента.Проведение, Результат = КодВозвратаДиалога.Да));
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДокументСнятияСБронированияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Если Не Записать() Тогда
			Возврат;		
		КонецЕсли;
		
		СоздатьДокументБронирования();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументБронирования()
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВидОперации", 						ПредопределенноеЗначение("Перечисление.ВидыОперацииБронирования.СнятиеБронирования"));
	ЗначенияЗаполнения.Вставить("ОснованиеДляСнятияБронирования", 	Объект.Ссылка);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ПараметрыФормы.Вставить("ЗначениеКопирования", Объект.Ссылка);
	
	ОткрытьФорму("Документ.Бронирование.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры // СоздатьДокументБронирования()

&НаСервере
Функция ВведёнДокументСнятияСБронирования()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Бронирование.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Бронирование КАК Бронирование
	|ГДЕ
	|	Бронирование.Проведен
	|	И Бронирование.ОснованиеДляСнятияБронирования = &ОснованиеДляСнятияБронирования";
	
	Запрос.УстановитьПараметр("ОснованиеДляСнятияБронирования", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Функция ПроверитьВозможностьСозданияДокумента()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыОбъектовНедвижимостиСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыОбъектовНедвижимости.СрезПоследних(, ОбъектНедвижимости = &ОбъектНедвижимости) КАК СтатусыОбъектовНедвижимостиСрезПоследних
	|ГДЕ
	|	СтатусыОбъектовНедвижимостиСрезПоследних.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовНедвижимости.Свободен), ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовНедвижимости.Забронирован))";
	Запрос.УстановитьПараметр("ОбъектНедвижимости", Объект.ОбъектНедвижимости);
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

&НаСерверебезКонтекста
Функция ПолучитьПризнакДействующейБрони(Ссылка)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыОбъектовНедвижимостиСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.СтатусыОбъектовНедвижимости.СрезПоследних КАК СтатусыОбъектовНедвижимостиСрезПоследних
	|ГДЕ
	|	СтатусыОбъектовНедвижимостиСрезПоследних.Регистратор = &Ссылка
	|	И СтатусыОбъектовНедвижимостиСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовНедвижимости.Забронирован)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти
